#+STARTUP: hidestars showall
** Use Canonical Equivalence
   - Use Canonical Equivalence for the unicode tables.
   - See: http://unicode.org/reports/tr15/tr15-18.html, Annex 4 for example of how to parse
   - Example:
#+BEGIN_SRC python
s = '00E1;LATIN SMALL LETTER A WITH ACUTE;Ll;0;L;0061 0301;;;;N;LATIN SMALL LETTER A ACUTE;;00C1;;00C1'
A = s.split(';')
return A[5]
#+END_SRC   

#+RESULTS:
: 0061 0301
   - Bracket characters that have mappings. Note that by using logics as below in the mapping table we basically ignore modifiers like <wide>,<narrow>,<super> etc when matching brackets.
#+BEGIN_SRC python
  def dehex(v):
    try:
      return int(v,16)
    except:
      return -1

  br = {}
  with open('gen.tab/unidata/BidiBrackets.txt') as fh:
    for line in fh:
       if len(line)==1 or line[0]=='#':
          continue
       a = line.split(';')
       br[dehex(a[0])] = dehex(a[1])

  eqv = {}
  with open('gen.tab/unidata/UnicodeData.txt') as fh:
    for line in fh:
      a = line.split(';')
      ch = dehex(a[0])
      if not ch in br:
        continue
      ce = [w for w in [dehex(v) for v in a[5].split(' ')] if w>0]
      if len(ce)==1:   # Skip all annotations like <wide>,<super>, etc.
        eqv[ch]=ce[0]

  for k in sorted(eqv.keys()):
    print '%x'%k,'%x'%eqv[k]
#+END_SRC   

#+RESULTS:
